linux和它的小伙伴/awesomewm配置.org
#+TITLE: awesomewm配置
#+AUTHOR: lujun9972
#+TAGS: linux和它的小伙伴
#+DATE: [2018-05-24 四 21:52]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* 配置文件所在路径

用户定义的配置文件路径为 =~/.config/awesome/rc.lua=

若不存在用户自定义配置文件则使用全局配置文件，路径为 =/etc/xdg/awesome/rc.lua=

* 更改主题
Awesome自带4个主题:default,sky,xresources和zenburn:
#+BEGIN_SRC shell :results org
  ls /usr/share/awesome/themes
#+END_SRC

#+BEGIN_SRC org
default
sky
xresources
zenburn
#+END_SRC

使用 =beautiful.init(path/to/theme.lua)= 来设置主题
#+BEGIN_SRC lua
  beautiful.init(gears.filesystem.get_dir("config") .. "/themes/sky/theme.lua")
#+END_SRC

** 更改背景图片
在theme文件中找到并修改 =beautiful.get().wallpaper= 的值
#+BEGIN_SRC lua
  beautiful.get().wallpaper = "/usr/share/awesome/themes/default/background.png"
#+END_SRC

* 设置可用的layout
=awful.layout.layouts= 中包含了所有可用的layout
#+BEGIN_SRC lua
  awful.layout.layouts = {
      awful.layout.suit.floating,
      awful.layout.suit.tile,
      awful.layout.suit.tile.left,
      awful.layout.suit.tile.bottom,
      awful.layout.suit.tile.top,
      awful.layout.suit.fair,
      awful.layout.suit.fair.horizontal,
      awful.layout.suit.spiral,
      awful.layout.suit.spiral.dwindle,
      awful.layout.suit.max,
      awful.layout.suit.max.fullscreen,
      awful.layout.suit.magnifier,
      awful.layout.suit.corner.nw,
      -- awful.layout.suit.corner.ne,
      -- awful.layout.suit.corner.sw,
      -- awful.layout.suit.corner.se,
  }
#+END_SRC

* 设置tags
通过 =awful.tag(names,s,layouts)= 可以设置各个tag的名称以及对应的layout

其中 =names= 是一个数组，指明了各个tag的名称.

=layouts= 可以是一个layout对象，表示所有tag都使用该layout，或者一个layout对象数组，用于设置每个tag各自对应的layout

#+BEGIN_SRC lua
  -- Each screen has its own tag table.
  local names = { "main", "www", "skype", "gimp", "office", "im", "7", "8", "9" }
  local l = awful.layout.suit  -- Just to save some typing: use an alias.
  local layouts = { l.floating, l.tile, l.floating, l.fair, l.max,
      l.floating, l.tile.left, l.floating, l.floating }
  awful.tag(names, s, layouts)
#+END_SRC
* 我的配置说明
** 加载Awesome API library
Awesome API分布在多个库中，需要一一加载才能用. 这些库包括:

+ gears :: 常用的工具
+ wibox :: Awesome的widget框架
+ awful :: window managment方面的功能
+ naughty :: 有关通知的功能
+ menubar :: XDG menu相关实现
+ beautiful :: Awesome主题相关的功能
               
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Standard awesome library
  local gears = require("gears")
  local awful = require("awful")
  require("awful.autofocus")
  -- Widget and layout library
  local wibox = require("wibox")
  -- Theme handling library
  local beautiful = require("beautiful")
  -- Notification library
  local naughty = require("naughty")
  local menubar = require("menubar")
  local hotkeys_popup = require("awful.hotkeys_popup").widget
  -- Enable VIM help for hotkeys widget when client with matching name is opened:
  require("awful.hotkeys_popup.keys.vim")
#+END_SRC

** 自定义一些函数
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  function file_exist_p (file)
    local f = io.open(file)
    if f ~= nil then
      io.close(f)
      return true
    else
      return false
    end
  end

  local function client_menu_toggle_fn()
    local instance = nil

    return function ()
      if instance and instance.wibox.visible then
        instance:hide()
        instance = nil
      else
        instance = awful.menu.clients({ theme = { width = 250 } })
      end
    end
  end
#+END_SRC
** 错误处理
错误可能会有以下几类：

+ 语法错误 :: 使用 =awesome -k= 来检查配置文件中是否存在语法错误
+ 动态语言类型错误 :: 可以使用 =luacheck= 来进行静态扫描
+ 废弃的API :: 若调用了废弃的API，则会在 =stderr= 和 =stdout= 中输出警告信息
            
=awesome.startup_errors= 中包含的是awesome启动期间的错误信息
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Check if awesome encountered an error during startup and fell back to
  -- another config (This code will only ever execute for the fallback config)
  if awesome.startup_errors then
      naughty.notify({ preset = naughty.config.presets.critical,
                       title = "Oops, there were errors during startup!",
                       text = awesome.startup_errors })
  end
#+END_SRC

=awesome.connect_signal(event,func)= 来注册当时间发生时调用哪个函数，其中
+ event为字符串形式的时间名称
+ func为触发调用的函数
  
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Handle runtime errors after startup
  do
      local in_error = false
      awesome.connect_signal("debug::error", function (err)
          -- Make sure we don't go into an endless error loop
          if in_error then return end
          in_error = true

          naughty.notify({ preset = naughty.config.presets.critical,
                           title = "Oops, an error happened!",
                           text = tostring(err) })
          in_error = false
      end)
  end
#+END_SRC
** 加载主题
=beautiful.init(config)= 函数初始化主题

其中 =config= 可以是一个字符串路径指向主题文件(这个主题文件的执行结果应该是一个包含各类主题变量与值的table)，或者直接就是一个table对象

使用 =beautiful.get()= 函数就能得到当前主题对象

与设置主题相关的变量有：

+ font :: 默认的字体
+ useless_gap :: 程序与程序之间的间距大小，默认为0
+ border_width :: 程序边框宽度
+ border_normal :: 程序边框的默认宽度.
+ border_focus :: 焦点所在程序的边框框读
+ wallpaper :: 壁纸的路径
+ awesome_icon :: Awesome图标的路径

#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Themes define colours, icons, font and wallpapers.
  beautiful.init(awful.util.get_themes_dir() .. "default/theme.lua")
  -- beautiful.init("~/.config/awesome/theme.lua")
#+END_SRC
