blog/2018/05/24/awesomewm配置/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>awesomewm配置 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="linux和它的小伙伴" />
  <link rel="stylesheet" media="screen" href="../../../../../media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">暗无天日</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <div class="menu-icon">
      </div>
      <ul class="trigger">
              <li><a href="../../../../../years/">Years</a></li>
              <li><a href="../../../../../authors/">Authors</a></li>
              <li><a href="../../../../../tags/">Tags</a></li>
              <li><a href="../../../../../about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com.git">Github</a></li>
              <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">awesomewm配置</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org63c4982">配置文件所在路径</a></li>
<li><a href="#org2eb3dd6">更改主题</a>
<ul>
<li><a href="#org7a0ff37">更改背景图片</a></li>
</ul>
</li>
<li><a href="#org628e7c2">设置可用的layout</a></li>
<li><a href="#org0a601df">设置tags</a></li>
<li><a href="#org4fda088">我的配置说明</a>
<ul>
<li><a href="#orgba320c0">加载Awesome API library</a></li>
<li><a href="#orge7b130a">自定义一些函数</a></li>
<li><a href="#org3d0a256">错误处理</a></li>
<li><a href="#org985b713">加载主题</a></li>
<li><a href="#org609e81e">定义一些变量</a></li>
<li><a href="#org0efe6ba">Menu</a></li>
<li><a href="#orge30cacd">Wibar</a>
<ul>
<li><a href="#orgece5d48">定义点击tag的行为</a></li>
<li><a href="#org0eb57bf">定义点击任务栏的行为</a></li>
<li><a href="#orgc1ecf63">当屏幕发生改变时，重新设置壁纸</a></li>
<li><a href="#org33dd665">设置屏幕布局</a></li>
</ul>
</li>
<li><a href="#org08b7620">设置鼠标操作</a>
<ul>
<li><a href="#org2e63a10">设置全局鼠标操作</a></li>
<li><a href="#org3fd06cd">设置client鼠标操作</a></li>
</ul>
</li>
<li><a href="#orgd55ae4f">设置快捷键</a>
<ul>
<li><a href="#orgbcdad03">设置全局快捷</a></li>
<li><a href="#orgc1b5404">设置client快捷键</a></li>
</ul>
</li>
<li><a href="#orgd861225">Rules</a></li>
<li><a href="#orgd3e1798">Signal</a></li>
<li><a href="#orgc54881d">设置自启动程序</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org63c4982" class="outline-2">
<h2 id="org63c4982">配置文件所在路径</h2>
<div class="outline-text-2" id="text-org63c4982">
<p>
用户定义的配置文件路径为 <code>~/.config/awesome/rc.lua</code>
</p>

<p>
若不存在用户自定义配置文件则使用全局配置文件，路径为 <code>/etc/xdg/awesome/rc.lua</code>
</p>
</div>
</div>

<div id="outline-container-org2eb3dd6" class="outline-2">
<h2 id="org2eb3dd6">更改主题</h2>
<div class="outline-text-2" id="text-org2eb3dd6">
<p>
Awesome自带4个主题:default,sky,xresources和zenburn:
</p>
<div class="org-src-container">
<pre class="src src-shell">ls /usr/share/awesome/themes
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">default
sky
xresources
zenburn
</pre>
</div>

<p>
使用 <code>beautiful.init(path/to/theme.lua)</code> 来设置主题
</p>
<div class="org-src-container">
<pre class="src src-lua">beautiful.init(gears.filesystem.get_dir("config") .. "/themes/sky/theme.lua")
</pre>
</div>
</div>

<div id="outline-container-org7a0ff37" class="outline-3">
<h3 id="org7a0ff37">更改背景图片</h3>
<div class="outline-text-3" id="text-org7a0ff37">
<p>
在theme文件中找到并修改 <code>beautiful.get().wallpaper</code> 的值
</p>
<div class="org-src-container">
<pre class="src src-lua">beautiful.get().wallpaper = "/usr/share/awesome/themes/default/background.png"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org628e7c2" class="outline-2">
<h2 id="org628e7c2">设置可用的layout</h2>
<div class="outline-text-2" id="text-org628e7c2">
<p>
<code>awful.layout.layouts</code> 中包含了所有可用的layout
</p>
<div class="org-src-container">
<pre class="src src-lua">awful.layout.layouts = {
    awful.layout.suit.floating,
    awful.layout.suit.tile,
    awful.layout.suit.tile.left,
    awful.layout.suit.tile.bottom,
    awful.layout.suit.tile.top,
    awful.layout.suit.fair,
    awful.layout.suit.fair.horizontal,
    awful.layout.suit.spiral,
    awful.layout.suit.spiral.dwindle,
    awful.layout.suit.max,
    awful.layout.suit.max.fullscreen,
    awful.layout.suit.magnifier,
    awful.layout.suit.corner.nw,
    -- awful.layout.suit.corner.ne,
    -- awful.layout.suit.corner.sw,
    -- awful.layout.suit.corner.se,
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a601df" class="outline-2">
<h2 id="org0a601df">设置tags</h2>
<div class="outline-text-2" id="text-org0a601df">
<p>
通过 <code>awful.tag(names,s,layouts)</code> 可以设置各个tag的名称以及对应的layout
</p>

<p>
其中 <code>names</code> 是一个数组，指明了各个tag的名称.
</p>

<p>
<code>layouts</code> 可以是一个layout对象，表示所有tag都使用该layout，或者一个layout对象数组，用于设置每个tag各自对应的layout
</p>

<div class="org-src-container">
<pre class="src src-lua">-- Each screen has its own tag table.
local names = { "main", "www", "skype", "gimp", "office", "im", "7", "8", "9" }
local l = awful.layout.suit  -- Just to save some typing: use an alias.
local layouts = { l.floating, l.tile, l.floating, l.fair, l.max,
    l.floating, l.tile.left, l.floating, l.floating }
awful.tag(names, s, layouts)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4fda088" class="outline-2">
<h2 id="org4fda088">我的配置说明</h2>
<div class="outline-text-2" id="text-org4fda088">
</div>
<div id="outline-container-orgba320c0" class="outline-3">
<h3 id="orgba320c0">加载Awesome API library</h3>
<div class="outline-text-3" id="text-orgba320c0">
<p>
Awesome API分布在多个库中，需要一一加载才能用. 这些库包括:
</p>

<dl class="org-dl">
<dt>gears</dt><dd>常用的工具</dd>
<dt>wibox</dt><dd>Awesome的widget框架</dd>
<dt>awful</dt><dd>window managment方面的功能</dd>
<dt>naughty</dt><dd>有关通知的功能</dd>
<dt>menubar</dt><dd>XDG menu相关实现</dd>
<dt>beautiful</dt><dd>Awesome主题相关的功能</dd>
</dl>

<div class="org-src-container">
<pre class="src src-lua">-- Standard awesome library
local gears = require("gears")
local awful = require("awful")
require("awful.autofocus")
-- Widget and layout library
local wibox = require("wibox")
-- Theme handling library
local beautiful = require("beautiful")
-- Notification library
local naughty = require("naughty")
local menubar = require("menubar")
local hotkeys_popup = require("awful.hotkeys_popup").widget
-- Enable VIM help for hotkeys widget when client with matching name is opened:
require("awful.hotkeys_popup.keys.vim")
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7b130a" class="outline-3">
<h3 id="orge7b130a">自定义一些函数</h3>
<div class="outline-text-3" id="text-orge7b130a">
<div class="org-src-container">
<pre class="src src-lua">function file_exist_p (file)
  local f = io.open(file)
  if f ~= nil then
    io.close(f)
    return true
  else
    return false
  end
end

local function client_menu_toggle_fn()
  local instance = nil

  return function ()
    if instance and instance.wibox.visible then
      instance:hide()
      instance = nil
    else
      instance = awful.menu.clients({ theme = { width = 250 } })
    end
  end
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d0a256" class="outline-3">
<h3 id="org3d0a256">错误处理</h3>
<div class="outline-text-3" id="text-org3d0a256">
<p>
错误可能会有以下几类：
</p>

<dl class="org-dl">
<dt>语法错误</dt><dd>使用 <code>awesome -k</code> 来检查配置文件中是否存在语法错误</dd>
<dt>动态语言类型错误</dt><dd>可以使用 <code>luacheck</code> 来进行静态扫描</dd>
<dt>废弃的API</dt><dd>若调用了废弃的API，则会在 <code>stderr</code> 和 <code>stdout</code> 中输出警告信息</dd>
</dl>

<p>
<code>awesome.startup_errors</code> 中包含的是awesome启动期间的错误信息
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Check if awesome encountered an error during startup and fell back to
-- another config (This code will only ever execute for the fallback config)
if awesome.startup_errors then
    naughty.notify({ preset = naughty.config.presets.critical,
                     title = "Oops, there were errors during startup!",
                     text = awesome.startup_errors })
end
</pre>
</div>

<p>
<code>awesome.connect_signal(event,func)</code> 来注册当时间发生时调用哪个函数，其中
</p>
<ul class="org-ul">
<li>event为字符串形式的时间名称</li>
<li>func为触发调用的函数</li>
</ul>

<div class="org-src-container">
<pre class="src src-lua">-- Handle runtime errors after startup
do
    local in_error = false
    awesome.connect_signal("debug::error", function (err)
        -- Make sure we don't go into an endless error loop
        if in_error then return end
        in_error = true

        naughty.notify({ preset = naughty.config.presets.critical,
                         title = "Oops, an error happened!",
                         text = tostring(err) })
        in_error = false
    end)
end
</pre>
</div>
</div>
</div>
<div id="outline-container-org985b713" class="outline-3">
<h3 id="org985b713">加载主题</h3>
<div class="outline-text-3" id="text-org985b713">
<p>
<code>beautiful.init(config)</code> 函数初始化主题
</p>

<p>
其中 <code>config</code> 可以是一个字符串路径指向主题文件(这个主题文件的执行结果应该是一个包含各类主题变量与值的table)，或者直接就是一个table对象
</p>

<p>
使用 <code>beautiful.get()</code> 函数就能得到当前主题对象
</p>

<p>
与设置主题相关的变量有：
</p>

<dl class="org-dl">
<dt>font</dt><dd>默认的字体</dd>
<dt>useless_gap</dt><dd>程序与程序之间的间距大小，默认为0</dd>
<dt>border_width</dt><dd>程序边框宽度</dd>
<dt>border_normal</dt><dd>程序边框的默认宽度.</dd>
<dt>border_focus</dt><dd>焦点所在程序的边框框读</dd>
<dt>wallpaper</dt><dd>壁纸的路径</dd>
<dt>awesome_icon</dt><dd>Awesome图标的路径</dd>
</dl>

<div class="org-src-container">
<pre class="src src-lua">-- Themes define colours, icons, font and wallpapers.
beautiful.init(awful.util.get_themes_dir() .. "default/theme.lua")
-- beautiful.init("~/.config/awesome/theme.lua")
</pre>
</div>
</div>
</div>
