linux和它的小伙伴/awesomewm配置.org
** 定义一些变量
定义终端、默认编辑器
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  -- This is used later as the default terminal and editor to run.
  terminal = "urxvt"
  editor = os.getenv("EDITOR") or "vi"
  editor_cmd = terminal .. " -e " .. editor
  emacsclient_newframe = "emacsclient -a \"\" -n -c "
#+END_SRC

设置默认的modkey
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  -- Default modkey.
  -- Usually, Mod4 is the key with a logo between Control and Alt.
  -- If you do not like this or do not have such a key,
  -- I suggest you to remap Mod4 to another key using xmodmap or other tools.
  -- However, you can use another modifier like Mod1, but it may interact with others.
  modkey = "Mod4"
#+END_SRC

定义可用的布局
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Table of layouts to cover with awful.layout.inc, order matters.
  awful.layout.layouts = {
      awful.layout.suit.floating,
      awful.layout.suit.tile,
      awful.layout.suit.tile.left,
      awful.layout.suit.tile.bottom,
      awful.layout.suit.tile.top,
      awful.layout.suit.fair,
      awful.layout.suit.fair.horizontal,
      awful.layout.suit.spiral,
      awful.layout.suit.spiral.dwindle,
      awful.layout.suit.max,
      awful.layout.suit.max.fullscreen,
      awful.layout.suit.magnifier,
      awful.layout.suit.corner.nw,
      -- awful.layout.suit.corner.ne,
      -- awful.layout.suit.corner.sw,
      -- awful.layout.suit.corner.se,
  }
#+END_SRC
** Menu
自定义菜单，其中一个菜单就是一个包含菜单项的数组。

而一个菜单项可以是：一个菜单或一个形如 ={菜单项名称,菜单项对应的函数或命令字符串[,菜单项图标]}=, 其中 =菜单项图标= 可以省略。
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Create a launcher widget and a main menu
  myawesomemenu = {
     { "hotkeys", function() return false, hotkeys_popup.show_help end},
     { "manual", emacsclient_newframe .. " -e '(man \"awesome\")'" },
     { "重建菜单", function ()
         os.execute("xdg_menu --format awesome --root-menu /etc/xdg/menus/arch-applications.menu >~/.config/awesome/archmenu.lua" )
         awesome.restart()
     end},
     -- { "edit config", emacsclient_newframe .. awesome.conffile },
     { "edit config", emacsclient_newframe .. "~/github/dotfile/dotfile.org" },
     -- { "manual", terminal .. " -e man awesome" },
     -- { "edit config", editor_cmd .. " " .. awesome.conffile },
     { "restart", awesome.restart },
     { "quit", function() awesome.quit() end}
  }

  -- 自动生成的xdg_menu
  xdg_menu = require("archmenu")
  mainmenu_items = { { "awesome", myawesomemenu, beautiful.awesome_icon },
    { "Applications", xdgmenu },
    { "Eshell", "eshell.sh"},
    { "dired", "dired.sh" },
    { "Firefox", "firefox" },
    { "open terminal", terminal }
  }
#+END_SRC

awful.menu:new(args,parent)用于生成menu对象，其中 =args= 是一个table，包含了menu的各项信息，该table可以具有以下三种key值:

+ items :: 必填，表示menu内容的table，格式如前所说
+ theme.[fg|bg][focus|normal], theme.bordercolor, theme.borderwidth, theme.submenuicon, theme.height , theme.width :: 可选，定义了menu的显示方法
+ auto_expand :: 定义是否自动弹出子菜单，默认为true,表示光标移动过去就自动弹出子菜单
                 
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  mymainmenu = awful.menu({ items = mainmenu_items
                          })
#+END_SRC
                 
awful.widget.launcher:new (args)函数创建一个button widget，点击之后执行特点的命令。

参数 =args= 是一个table,该table除了能包含标准widget table的那些参数外，还能有以下key值

+ image :: 图片的路径，该图片用于显示该button widget的外观
+ command :: 指定点击widget后运行的命令
+ menu :: 指定点击widget后要弹出的菜单
          
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  mylauncher= awful.widget.launcher({ image = beautiful.awesome_icon,
                                       menu = mymainmenu })

  emacslauncher = awful.widget.launcher({ image = "/usr/share/icons/hicolor/128x128/apps/emacs.png",
  command = "/usr/bin/emacsclient -a '' -n -c"})

#+END_SRC

menubar.utils.terminal指定了当应用需要在终端运行时，打开哪个终端
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  menubar.utils.terminal = terminal -- Set the terminal for applications that require it
#+END_SRC

awful.widget.keyboardlayout:new ()创建一个键盘布局的widget,用于显示当前的键盘布局
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  -- Keyboard map indicator and switcher
  mykeyboardlayout = awful.widget.keyboardlayout()
#+END_SRC
** Wibar

~wibox.widget.textclock ([format[, timeout[, timezone]]])~ 创建一个textclock widget，用于显示时间。其中

+ format :: 指明时间的格式，默认为"%a %b %d"
+ timeout :: 指定多少秒更新一次时间，默认为60
+ timezone :: 指明时区默认为本地时区
              
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  -- Create a textclock widget
  mytextclock = wibox.widget.textclock()
#+END_SRC

*** 定义点击tag的行为
=gears.table.join(tables)= 会遍历参数中的所有table中的key，插入成一个新的table

而awful.button:new (mod, _button, press[, release])方法创建一个可以点击的按钮table，其中

+ mod :: 定义鼠标点击时，一同按下哪个modifer
+ _button :: 定义了用哪个鼠标键进行点击操作
+ press :: 定义了点击按下时运行的函数
+ release :: 定义了点击释放时运行的函数
             
需要说明的是， =awful.button:new= 会根据 =awful.button.ignore_modifiers= 的值来生成多个版本的button对象。
比如，默认 =awful.button.ignore_modifiers= 会忽略  ={ "Lock", "Mod2" }= 这两个按键，那么 =awful.button:new= 会生成4个button object，分别对应没有按下 ={ "Lock", "Mod2" }= 的情况，按下 ={ "Lock", "Mod2" }= 的情况， 按下 ={ "Lock"}=  的情况和按下 ={ "Mod2"}= 的情况.
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- Create a wibox for each screen and add it
  local taglist_buttons = gears.table.join(

    -- 点击左键，切换到该tag
    awful.button({ }, 1, function(t) t:view_only() end), 
    -- modkey+左键，将当前window移动到指定tag
    awful.button({ modkey }, 1, function(t)
        if client.focus then
          client.focus:move_to_tag(t)
        end
    end),
    -- 点击右键，让指定tag也可见
    awful.button({ }, 3, awful.tag.viewtoggle),
    -- modkey+右键，让当前window在指定tag也可见
    awful.button({ modkey }, 3, function(t)
        if client.focus then
          client.focus:toggle_tag(t)
        end
    end),
    awful.button({ }, 4, function(t) awful.tag.viewnext(t.screen) end),
    awful.button({ }, 5, function(t) awful.tag.viewprev(t.screen) end)
  )
#+END_SRC
*** 定义点击任务栏的行为
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  local tasklist_buttons = gears.table.join(
    awful.button({ }, 1, function (c)
        if c == client.focus then
          c.minimized = true
        else
          -- Without this, the following
          -- :isvisible() makes no sense
          c.minimized = false
          if not c:isvisible() and c.first_tag then
            c.first_tag:view_only()
          end
          -- This will also un-minimize
          -- the client, if needed
          client.focus = c
          c:raise()
        end
    end),
    awful.button({ }, 3, client_menu_toggle_fn()),
    awful.button({ }, 4, function ()
        awful.client.focus.byidx(1)
    end),
    awful.button({ }, 5, function ()
        awful.client.focus.byidx(-1)
  end))
#+END_SRC
