blog/2018/05/24/awesomewm配置/index.html
<div id="outline-container-org609e81e" class="outline-3">
<h3 id="org609e81e">定义一些变量</h3>
<div class="outline-text-3" id="text-org609e81e">
<p>
定义终端、默认编辑器
</p>
<div class="org-src-container">
<pre class="src src-lua">-- This is used later as the default terminal and editor to run.
terminal = "urxvt"
editor = os.getenv("EDITOR") or "vi"
editor_cmd = terminal .. " -e " .. editor
emacsclient_newframe = "emacsclient -a \"\" -n -c "
</pre>
</div>

<p>
设置默认的modkey
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Default modkey.
-- Usually, Mod4 is the key with a logo between Control and Alt.
-- If you do not like this or do not have such a key,
-- I suggest you to remap Mod4 to another key using xmodmap or other tools.
-- However, you can use another modifier like Mod1, but it may interact with others.
modkey = "Mod4"
</pre>
</div>

<p>
定义可用的布局
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Table of layouts to cover with awful.layout.inc, order matters.
awful.layout.layouts = {
    awful.layout.suit.floating,
    awful.layout.suit.tile,
    awful.layout.suit.tile.left,
    awful.layout.suit.tile.bottom,
    awful.layout.suit.tile.top,
    awful.layout.suit.fair,
    awful.layout.suit.fair.horizontal,
    awful.layout.suit.spiral,
    awful.layout.suit.spiral.dwindle,
    awful.layout.suit.max,
    awful.layout.suit.max.fullscreen,
    awful.layout.suit.magnifier,
    awful.layout.suit.corner.nw,
    -- awful.layout.suit.corner.ne,
    -- awful.layout.suit.corner.sw,
    -- awful.layout.suit.corner.se,
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0efe6ba" class="outline-3">
<h3 id="org0efe6ba">Menu</h3>
<div class="outline-text-3" id="text-org0efe6ba">
<p>
自定义菜单，其中一个菜单就是一个包含菜单项的数组。
</p>

<p>
而一个菜单项可以是：一个菜单或一个形如 <code>{菜单项名称,菜单项对应的函数或命令字符串[,菜单项图标]}</code>, 其中 <code>菜单项图标</code> 可以省略。
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Create a launcher widget and a main menu
myawesomemenu = {
   { "hotkeys", function() return false, hotkeys_popup.show_help end},
   { "manual", emacsclient_newframe .. " -e '(man \"awesome\")'" },
   { "重建菜单", function ()
       os.execute("xdg_menu --format awesome --root-menu /etc/xdg/menus/arch-applications.menu &gt;~/.config/awesome/archmenu.lua" )
       awesome.restart()
   end},
   -- { "edit config", emacsclient_newframe .. awesome.conffile },
   { "edit config", emacsclient_newframe .. "~/github/dotfile/dotfile.org" },
   -- { "manual", terminal .. " -e man awesome" },
   -- { "edit config", editor_cmd .. " " .. awesome.conffile },
   { "restart", awesome.restart },
   { "quit", function() awesome.quit() end}
}

-- 自动生成的xdg_menu
xdg_menu = require("archmenu")
mainmenu_items = { { "awesome", myawesomemenu, beautiful.awesome_icon },
  { "Applications", xdgmenu },
  { "Eshell", "eshell.sh"},
  { "dired", "dired.sh" },
  { "Firefox", "firefox" },
  { "open terminal", terminal }
}
</pre>
</div>

<p>
awful.menu:new(args,parent)用于生成menu对象，其中 <code>args</code> 是一个table，包含了menu的各项信息，该table可以具有以下三种key值:
</p>

<dl class="org-dl">
<dt>items</dt><dd>必填，表示menu内容的table，格式如前所说</dd>
<dt>theme.[fg|bg][focus|normal], theme.bordercolor, theme.borderwidth, theme.submenuicon, theme.height , theme.width</dt><dd>可选，定义了menu的显示方法</dd>
<dt>auto_expand</dt><dd>定义是否自动弹出子菜单，默认为true,表示光标移动过去就自动弹出子菜单</dd>
</dl>

<div class="org-src-container">
<pre class="src src-lua">mymainmenu = awful.menu({ items = mainmenu_items
                        })
</pre>
</div>

<p>
awful.widget.launcher:new (args)函数创建一个button widget，点击之后执行特点的命令。
</p>

<p>
参数 <code>args</code> 是一个table,该table除了能包含标准widget table的那些参数外，还能有以下key值
</p>

<dl class="org-dl">
<dt>image</dt><dd>图片的路径，该图片用于显示该button widget的外观</dd>
<dt>command</dt><dd>指定点击widget后运行的命令</dd>
<dt>menu</dt><dd>指定点击widget后要弹出的菜单</dd>
</dl>

<div class="org-src-container">
<pre class="src src-lua">mylauncher= awful.widget.launcher({ image = beautiful.awesome_icon,
                                     menu = mymainmenu })

emacslauncher = awful.widget.launcher({ image = "/usr/share/icons/hicolor/128x128/apps/emacs.png",
command = "/usr/bin/emacsclient -a '' -n -c"})

</pre>
</div>

<p>
menubar.utils.terminal指定了当应用需要在终端运行时，打开哪个终端
</p>
<div class="org-src-container">
<pre class="src src-lua">menubar.utils.terminal = terminal -- Set the terminal for applications that require it
</pre>
</div>

<p>
awful.widget.keyboardlayout:new ()创建一个键盘布局的widget,用于显示当前的键盘布局
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Keyboard map indicator and switcher
mykeyboardlayout = awful.widget.keyboardlayout()
</pre>
</div>
</div>
</div>
<div id="outline-container-orge30cacd" class="outline-3">
<h3 id="orge30cacd">Wibar</h3>
<div class="outline-text-3" id="text-orge30cacd">
<p>
<code>wibox.widget.textclock ([format[, timeout[, timezone]]])</code> 创建一个textclock widget，用于显示时间。其中
</p>

<dl class="org-dl">
<dt>format</dt><dd>指明时间的格式，默认为"%a %b %d"</dd>
<dt>timeout</dt><dd>指定多少秒更新一次时间，默认为60</dd>
<dt>timezone</dt><dd>指明时区默认为本地时区</dd>
</dl>

<div class="org-src-container">
<pre class="src src-lua">-- Create a textclock widget
mytextclock = wibox.widget.textclock()
</pre>
</div>
</div>

<div id="outline-container-orgece5d48" class="outline-4">
<h4 id="orgece5d48">定义点击tag的行为</h4>
<div class="outline-text-4" id="text-orgece5d48">
<p>
<code>gears.table.join(tables)</code> 会遍历参数中的所有table中的key，插入成一个新的table
</p>

<p>
而awful.button:new (mod, _button, press[, release])方法创建一个可以点击的按钮table，其中
</p>

<dl class="org-dl">
<dt>mod</dt><dd>定义鼠标点击时，一同按下哪个modifer</dd>
<dt>_button</dt><dd>定义了用哪个鼠标键进行点击操作</dd>
<dt>press</dt><dd>定义了点击按下时运行的函数</dd>
<dt>release</dt><dd>定义了点击释放时运行的函数</dd>
</dl>

<p>
需要说明的是， <code>awful.button:new</code> 会根据 <code>awful.button.ignore_modifiers</code> 的值来生成多个版本的button对象。
比如，默认 <code>awful.button.ignore_modifiers</code> 会忽略  <code>{ "Lock", "Mod2" }</code> 这两个按键，那么 <code>awful.button:new</code> 会生成4个button object，分别对应没有按下 <code>{ "Lock", "Mod2" }</code> 的情况，按下 <code>{ "Lock", "Mod2" }</code> 的情况， 按下 <code>{ "Lock"}</code>  的情况和按下 <code>{ "Mod2"}</code> 的情况.
</p>
<div class="org-src-container">
<pre class="src src-lua">-- Create a wibox for each screen and add it
local taglist_buttons = gears.table.join(

  -- 点击左键，切换到该tag
  awful.button({ }, 1, function(t) t:view_only() end), 
  -- modkey+左键，将当前window移动到指定tag
  awful.button({ modkey }, 1, function(t)
      if client.focus then
        client.focus:move_to_tag(t)
      end
  end),
  -- 点击右键，让指定tag也可见
  awful.button({ }, 3, awful.tag.viewtoggle),
  -- modkey+右键，让当前window在指定tag也可见
  awful.button({ modkey }, 3, function(t)
      if client.focus then
        client.focus:toggle_tag(t)
      end
  end),
  awful.button({ }, 4, function(t) awful.tag.viewnext(t.screen) end),
  awful.button({ }, 5, function(t) awful.tag.viewprev(t.screen) end)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0eb57bf" class="outline-4">
<h4 id="org0eb57bf">定义点击任务栏的行为</h4>
<div class="outline-text-4" id="text-org0eb57bf">
<div class="org-src-container">
<pre class="src src-lua">local tasklist_buttons = gears.table.join(
  awful.button({ }, 1, function (c)
      if c == client.focus then
        c.minimized = true
      else
        -- Without this, the following
        -- :isvisible() makes no sense
        c.minimized = false
        if not c:isvisible() and c.first_tag then
          c.first_tag:view_only()
        end
        -- This will also un-minimize
        -- the client, if needed
        client.focus = c
        c:raise()
      end
  end),
  awful.button({ }, 3, client_menu_toggle_fn()),
  awful.button({ }, 4, function ()
      awful.client.focus.byidx(1)
  end),
  awful.button({ }, 5, function ()
      awful.client.focus.byidx(-1)
end))
</pre>
</div>
</div>
</div>
