linux和它的小伙伴/awesomewm配置.org
*** 当屏幕发生改变时，重新设置壁纸
~gears.wallpaper.maximized(surf, s, ignore_aspect, offset)~ 以最大化的方式设置壁纸，其中

+ surf :: 要设置的壁纸
+ s :: 在哪个屏幕中设置该壁纸
+ ignore_aspect :: 是否忽略长宽比，默认为否
+ offset :: 设置壁纸的偏移量

除了 =maximized= 这种壁纸设置方法外，还有其他的设置方法：

+ centered (surf, s, background, scale)
+ tiled (surf, s, offset)
+ fit (surf, s, background)
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  local function set_wallpaper(s)
      -- Wallpaper
      if beautiful.wallpaper then
          local wallpaper = beautiful.wallpaper
          -- If wallpaper is a function, call it with the screen
          if type(wallpaper) == "function" then
              wallpaper = wallpaper(s)
          end
          gears.wallpaper.maximized(wallpaper, s, true)
      end
  end

  -- Re-set wallpaper when a screen's geometry changes (e.g. different resolution)
  screen.connect_signal("property::geometry", set_wallpaper)
#+END_SRC

*** 设置屏幕布局
~awful.screen.connect_for_each_screen (func)~ 为每个已存在的，且后面新创建的屏幕都调用 =func=, 其中 =func= 接受一个 =screen= 作为参数
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  awful.screen.connect_for_each_screen(function(s)
      -- Wallpaper
      set_wallpaper(s)

      -- Each screen has its own tag table.
      awful.tag({ "1.HOME", "2.STUDIO", "3.GAMES", "4.EDIT", "5.VM", "6.IRC"}, s, awful.layout.layouts[1])

      -- Create a promptbox for each screen
      s.mypromptbox = awful.widget.prompt()
      -- Create an imagebox widget which will contains an icon indicating which layout we're using.
      -- We need one layoutbox per screen.
      s.mylayoutbox = awful.widget.layoutbox(s)
      s.mylayoutbox:buttons(gears.table.join(
                             awful.button({ }, 1, function () awful.layout.inc( 1) end),
                             awful.button({ }, 3, function () awful.layout.inc(-1) end),
                             awful.button({ }, 4, function () awful.layout.inc( 1) end),
                             awful.button({ }, 5, function () awful.layout.inc(-1) end)))
      -- Create a taglist widget
      s.mytaglist = awful.widget.taglist(s, awful.widget.taglist.filter.all, taglist_buttons)

      -- Create a tasklist widget
      s.mytasklist = awful.widget.tasklist(s, awful.widget.tasklist.filter.currenttags, tasklist_buttons)

      -- Create the wibox
      s.mywibox = awful.wibar({ position = "top", screen = s })

      -- Add widgets to the wibox
      s.mywibox:setup {
          layout = wibox.layout.align.horizontal,
          { -- Left widgets
              layout = wibox.layout.fixed.horizontal,
              mylauncher,
              emacslauncher,
              s.mytaglist,
              s.mypromptbox,
          },
          s.mytasklist, -- Middle widget
          { -- Right widgets
              layout = wibox.layout.fixed.horizontal,
              mykeyboardlayout,
              wibox.widget.systray(),
              mytextclock,
              s.mylayoutbox,
          },
      }
  end)
#+END_SRC
** 设置鼠标操作
*** 设置全局鼠标操作
全局鼠标操作是在root窗口进行鼠标操作时触发的操作，awesome不带任何参数调用对应的函数。

使用 ~root.buttons (button_table)~ 函数获取/设置全局的鼠标操作
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  root.buttons(gears.table.join(
      awful.button({ }, 3, function () mymainmenu:toggle() end),
      awful.button({ }, 4, awful.tag.viewnext),
      awful.button({ }, 5, awful.tag.viewprev)
  ))
#+END_SRC
*** 设置client鼠标操作

client鼠标操作是当有window获取到焦点时触发的操作，awesome将当前捕获到焦点的window作为参数传递给对应的函数。
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  clientbuttons = gears.table.join(
      awful.button({ }, 1, function (c) client.focus = c; c:raise() end),
      awful.button({ modkey }, 1, awful.mouse.client.move),
      awful.button({ modkey }, 3, awful.mouse.client.resize))
#+END_SRC

client鼠标操作需要通client的buttons属性来设置，参见后面的Rules章节
** 设置快捷键
每个快捷键都保存为一个key对象。

key对象通过 =awful.key:new (mod, _key, press[, release], data)= 来产生，其中

+ mod :: 为一个包含0个或多个modifier key的table。能作为modifier key的键有Mod1, Mod2, Mod3, Mod4, Mod5, Shift, Lock 和 Control.
+ _key :: 为触发事件的按键或键码(通过xev命令来获取)
+ press :: 按下快捷键调用的函数
+ release :: 释放快捷键时调用的函数
+ data :: 额外的元数据，提供给 =awful.hotkeys_popup= widget使用
          
需要说明的是: =awful.key:new= 函数返回的是一个包含一个或多个key对象的table,这也是为什么能用 =gears.table.join= 来整合的原因。

此外，类似 =awful.button=, =awful.key:new= 也会受到 =awful.key.ignore_modifiers= 的影响

