blog/2018/05/24/awesomewm配置/index.html
<div id="outline-container-orgc1ecf63" class="outline-4">
<h4 id="orgc1ecf63">当屏幕发生改变时，重新设置壁纸</h4>
<div class="outline-text-4" id="text-orgc1ecf63">
<p>
<code>gears.wallpaper.maximized(surf, s, ignore_aspect, offset)</code> 以最大化的方式设置壁纸，其中
</p>

<dl class="org-dl">
<dt>surf</dt><dd>要设置的壁纸</dd>
<dt>s</dt><dd>在哪个屏幕中设置该壁纸</dd>
<dt>ignore_aspect</dt><dd>是否忽略长宽比，默认为否</dd>
<dt>offset</dt><dd>设置壁纸的偏移量</dd>
</dl>

<p>
除了 <code>maximized</code> 这种壁纸设置方法外，还有其他的设置方法：
</p>

<ul class="org-ul">
<li>centered (surf, s, background, scale)</li>
<li>tiled (surf, s, offset)</li>
<li>fit (surf, s, background)</li>
</ul>
<div class="org-src-container">
<pre class="src src-lua">local function set_wallpaper(s)
    -- Wallpaper
    if beautiful.wallpaper then
        local wallpaper = beautiful.wallpaper
        -- If wallpaper is a function, call it with the screen
        if type(wallpaper) == "function" then
            wallpaper = wallpaper(s)
        end
        gears.wallpaper.maximized(wallpaper, s, true)
    end
end

-- Re-set wallpaper when a screen's geometry changes (e.g. different resolution)
screen.connect_signal("property::geometry", set_wallpaper)
</pre>
</div>
</div>
</div>

<div id="outline-container-org33dd665" class="outline-4">
<h4 id="org33dd665">设置屏幕布局</h4>
<div class="outline-text-4" id="text-org33dd665">
<p>
<code>awful.screen.connect_for_each_screen (func)</code> 为每个已存在的，且后面新创建的屏幕都调用 <code>func</code>, 其中 <code>func</code> 接受一个 <code>screen</code> 作为参数
</p>
<div class="org-src-container">
<pre class="src src-lua">awful.screen.connect_for_each_screen(function(s)
    -- Wallpaper
    set_wallpaper(s)

    -- Each screen has its own tag table.
    awful.tag({ "1.HOME", "2.STUDIO", "3.GAMES", "4.EDIT", "5.VM", "6.IRC"}, s, awful.layout.layouts[1])

    -- Create a promptbox for each screen
    s.mypromptbox = awful.widget.prompt()
    -- Create an imagebox widget which will contains an icon indicating which layout we're using.
    -- We need one layoutbox per screen.
    s.mylayoutbox = awful.widget.layoutbox(s)
    s.mylayoutbox:buttons(gears.table.join(
                           awful.button({ }, 1, function () awful.layout.inc( 1) end),
                           awful.button({ }, 3, function () awful.layout.inc(-1) end),
                           awful.button({ }, 4, function () awful.layout.inc( 1) end),
                           awful.button({ }, 5, function () awful.layout.inc(-1) end)))
    -- Create a taglist widget
    s.mytaglist = awful.widget.taglist(s, awful.widget.taglist.filter.all, taglist_buttons)

    -- Create a tasklist widget
    s.mytasklist = awful.widget.tasklist(s, awful.widget.tasklist.filter.currenttags, tasklist_buttons)

    -- Create the wibox
    s.mywibox = awful.wibar({ position = "top", screen = s })

    -- Add widgets to the wibox
    s.mywibox:setup {
        layout = wibox.layout.align.horizontal,
        { -- Left widgets
            layout = wibox.layout.fixed.horizontal,
            mylauncher,
            emacslauncher,
            s.mytaglist,
            s.mypromptbox,
        },
        s.mytasklist, -- Middle widget
        { -- Right widgets
            layout = wibox.layout.fixed.horizontal,
            mykeyboardlayout,
            wibox.widget.systray(),
            mytextclock,
            s.mylayoutbox,
        },
    }
end)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org08b7620" class="outline-3">
<h3 id="org08b7620">设置鼠标操作</h3>
<div class="outline-text-3" id="text-org08b7620">
</div>
<div id="outline-container-org2e63a10" class="outline-4">
<h4 id="org2e63a10">设置全局鼠标操作</h4>
<div class="outline-text-4" id="text-org2e63a10">
<p>
全局鼠标操作是在root窗口进行鼠标操作时触发的操作，awesome不带任何参数调用对应的函数。
</p>

<p>
使用 <code>root.buttons (button_table)</code> 函数获取/设置全局的鼠标操作
</p>
<div class="org-src-container">
<pre class="src src-lua">root.buttons(gears.table.join(
    awful.button({ }, 3, function () mymainmenu:toggle() end),
    awful.button({ }, 4, awful.tag.viewnext),
    awful.button({ }, 5, awful.tag.viewprev)
))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fd06cd" class="outline-4">
<h4 id="org3fd06cd">设置client鼠标操作</h4>
<div class="outline-text-4" id="text-org3fd06cd">
<p>
client鼠标操作是当有window获取到焦点时触发的操作，awesome将当前捕获到焦点的window作为参数传递给对应的函数。
</p>
<div class="org-src-container">
<pre class="src src-lua">clientbuttons = gears.table.join(
    awful.button({ }, 1, function (c) client.focus = c; c:raise() end),
    awful.button({ modkey }, 1, awful.mouse.client.move),
    awful.button({ modkey }, 3, awful.mouse.client.resize))
</pre>
</div>

<p>
client鼠标操作需要通client的buttons属性来设置，参见后面的Rules章节
</p>
</div>
</div>
</div>
<div id="outline-container-orgd55ae4f" class="outline-3">
<h3 id="orgd55ae4f">设置快捷键</h3>
<div class="outline-text-3" id="text-orgd55ae4f">
<p>
每个快捷键都保存为一个key对象。
</p>

<p>
key对象通过 <code>awful.key:new (mod, _key, press[, release], data)</code> 来产生，其中
</p>

<dl class="org-dl">
<dt>mod</dt><dd>为一个包含0个或多个modifier key的table。能作为modifier key的键有Mod1, Mod2, Mod3, Mod4, Mod5, Shift, Lock 和 Control.</dd>
<dt>_key</dt><dd>为触发事件的按键或键码(通过xev命令来获取)</dd>
<dt>press</dt><dd>按下快捷键调用的函数</dd>
<dt>release</dt><dd>释放快捷键时调用的函数</dd>
<dt>data</dt><dd>额外的元数据，提供给 <code>awful.hotkeys_popup</code> widget使用</dd>
</dl>

<p>
需要说明的是: <code>awful.key:new</code> 函数返回的是一个包含一个或多个key对象的table,这也是为什么能用 <code>gears.table.join</code> 来整合的原因。
</p>

<p>
此外，类似 <code>awful.button</code>, <code>awful.key:new</code> 也会受到 <code>awful.key.ignore_modifiers</code> 的影响
</p>
</div>
