linux和它的小伙伴/awesomewm配置.org
*** 设置client快捷键
client快捷键是当有焦点在window(client)上时才能触发的。这时awesome调用快捷键上的函数时会将当前client作为参数传递过去。
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  clientkeys = gears.table.join(
    awful.key({ modkey,           }, "f",
      function (c)
        c.fullscreen = not c.fullscreen
        c:raise()
      end,
      {description = "toggle fullscreen", group = "client"}),
    awful.key({ modkey, "Shift"   }, "c",      function (c) c:kill()                         end,
      {description = "close", group = "client"}),
    awful.key({ modkey, "Control" }, "space",  awful.client.floating.toggle                     ,
      {description = "toggle floating", group = "client"}),
    awful.key({ modkey, "Control" }, "Return", function (c) c:swap(awful.client.getmaster()) end,
      {description = "move to master", group = "client"}),
    awful.key({ modkey,           }, "o",      function (c) c:move_to_screen()               end,
      {description = "move to screen", group = "client"}),
    awful.key({ modkey,           }, "t",      function (c) c.ontop = not c.ontop            end,
      {description = "toggle keep on top", group = "client"}),
    awful.key({ modkey,           }, "n",
      function (c)
        -- The client currently has the input focus, so it cannot be
        -- minimized, since minimized clients can't have the focus.
        c.minimized = true
      end ,
      {description = "minimize", group = "client"}),
    awful.key({ modkey,           }, "m",
      function (c)
        c.maximized = not c.maximized
        c:raise()
      end ,
      {description = "(un)maximize", group = "client"}),
    awful.key({ modkey, "Control" }, "m",
      function (c)
        c.maximized_vertical = not c.maximized_vertical
        c:raise()
      end ,
      {description = "(un)maximize vertically", group = "client"}),
    awful.key({ modkey, "Shift"   }, "m",
      function (c)
        c.maximized_horizontal = not c.maximized_horizontal
        c:raise()
      end ,
      {description = "(un)maximize horizontally", group = "client"})
  )
#+END_SRC

client快捷键需要通过对client的keys属性来进行设置(参见Rules章节)
** Rules
=awful.rules.rules= 是全局的规则表，这里定义的规则适用于所有新开的window。

一个规则由 =rule= / =rule_any= ， =except= / =except_any= , =properties= / =callback= 组成，其中:

+ =rule= 定义了条件,其中的条件都必须满足才能满足该rule
+ =rule_any= 定义了条件,其中的条件只需要满足一个就能满足该rule
+ =except= / =except_any= 定义了符合rule但需要排除掉的那些特殊情况
+ =properties= 定义了client的属性,若属性值为函数，则该函数的返回值会作为属性的值。
+ =callback= 定义了触发的回调函数,该回调函数会接受打开的client作为参数

属性是可以任意的，但下面的属性有特殊的意义

+ placement
+ honor_padding
+ honor_workarea
+ tag
+ new_tag
+ switchtotag
+ focus
+ titlebars_enabled
+ callback
+ keys
+ buttons

  
#+BEGIN_SRC  lua :tangle "~/.config/awesome/rc.lua"
  -- Rules to apply to new clients (through the "manage" signal).
  awful.rules.rules = {
      -- All clients will match this rule.
      { rule = { },
        properties = { border_width = beautiful.border_width,
                       border_color = beautiful.border_normal,
                       focus = awful.client.focus.filter,
                       raise = true,
                       keys = clientkeys,
                       buttons = clientbuttons,
                       screen = awful.screen.preferred,
                       placement = awful.placement.no_overlap+awful.placement.no_offscreen
       }
      },
      { rule = { class = "MPlayer" },
        properties = { floating = true } },
      { rule = { class = "pinentry" },
        properties = { floating = true } },
      { rule = { class = "gimp" },
        properties = { floating = true } },
      { rule = { class = "Firefox" },
        properties = { floating = true } },
      -- 这里class通过xprop程序来获取
      { rule = { class = "VirtualBox Manager" },
        properties = { tag="5.VM", switchtotag = true } },

      -- Floating clients.
      { rule_any = {
          instance = {
            "DTA",  -- Firefox addon DownThemAll.
            "copyq",  -- Includes session name in class.
          },
          class = {
            "Arandr",
            "Gpick",
            "Kruler",
            "MessageWin",  -- kalarm.
            "Sxiv",
            "Wpa_gui",
            "pinentry",
            "veromix",
            "xtightvncviewer"},

          name = {
            "Event Tester",  -- xev.
          },
          role = {
            "AlarmWindow",  -- Thunderbird's calendar.
            "pop-up",       -- e.g. Google Chrome's (detached) Developer Tools.
          }
        }, properties = { floating = true }},

      -- Add titlebars to normal clients and dialogs
      { rule_any = {type = { "normal", "dialog" }
        }, properties = { titlebars_enabled = true }
      },

  }
#+END_SRC
** Signal
注册事件发生时的触发函数,该函数接受一个窗口(client对象)作为参数
#+BEGIN_SRC lua :tangle "~/.config/awesome/rc.lua"
  -- {{{ Signals
  -- Signal function to execute when a new client appears.
  client.connect_signal("manage", function (c)
      -- Set the windows at the slave,
      -- i.e. put it at the end of others instead of setting it master.
      -- if not awesome.startup then awful.client.setslave(c) end

      if awesome.startup and
        not c.size_hints.user_position
        and not c.size_hints.program_position then
          -- Prevent clients from being unreachable after screen count changes.
          awful.placement.no_offscreen(c)
      end
  end)

  -- Add a titlebar if titlebars_enabled is set to true in the rules.
  client.connect_signal("request::titlebars", function(c)
      -- buttons for the titlebar
      local buttons = gears.table.join(
          awful.button({ }, 1, function()
              client.focus = c
              c:raise()
              awful.mouse.client.move(c)
          end),
          awful.button({ }, 3, function()
              client.focus = c
              c:raise()
              awful.mouse.client.resize(c)
          end)
      )

      awful.titlebar(c) : setup {
          { -- Left
              awful.titlebar.widget.iconwidget(c),
              buttons = buttons,
              layout  = wibox.layout.fixed.horizontal
          },
          { -- Middle
              { -- Title
                  align  = "center",
                  widget = awful.titlebar.widget.titlewidget(c)
              },
              buttons = buttons,
              layout  = wibox.layout.flex.horizontal
          },
          { -- Right
              awful.titlebar.widget.floatingbutton (c),
              awful.titlebar.widget.maximizedbutton(c),
              awful.titlebar.widget.stickybutton   (c),
              awful.titlebar.widget.ontopbutton    (c),
              awful.titlebar.widget.closebutton    (c),
              layout = wibox.layout.fixed.horizontal()
          },
          layout = wibox.layout.align.horizontal
      }
  end)

  -- Enable sloppy focus, so that focus follows mouse.
  client.connect_signal("mouse::enter", function(c)
      if awful.layout.get(c.screen) ~= awful.layout.suit.magnifier
          and awful.client.focus.filter(c) then
          client.focus = c
      end
  end)

  client.connect_signal("focus", function(c) c.border_color = beautiful.border_focus end)
  client.connect_signal("unfocus", function(c) c.border_color = beautiful.border_normal end)
  -- }}}

#+END_SRC
